package com.kang.oct202.main;

//	언어
//		조건문(if,switch)
//		반복문(for, while, do-while)
//		Java는 Collection(다른 언어는 배열)
//////////////////////////////////
//		객체지향
//		외부 라이브러리 활용
//		HTTP통신 - Parsing
////////////////////////
//		배열 : 변수 하나에 데이터 여러개
//			[]
//			만들 때 사이즈가 고정되어 있어서 사이즈를 모르면 배열 만들기가 애매
//			사이즈 변경도 불가능
/////////////////////////
//	컬렉션(Collection) : Java에서 자료구조를 표현한 클래스를 지칭하는 용어
//			ㄴ 자료구조(data structure) : 자료를 저장하기 위한 구조

//		List 계열
//			사이즈 바꿀 수 있음(가변사이즈)
//			순서가 있는 자료구조, 중복된 요소 가능
//		Set 계열(잘 안쓰임)
//			가변사이즈
//			중복 제거 (자동으로 삭제)
//			순서가 랜덤
//		Map 계열
//			가변사이즈
//			Key값, Value값이 한쌍 (key를 부르면 value가 같이)
//			순서개념 X



public class CMain1 {

}
